using System.Linq;

namespace QingFeng.CoreUtils.ChineseNumber
{
    internal class An2CnConverterTestData
    {
        public static (decimal, string)[] GetRmbFmtTestData()
        {
            return new (decimal, string)[]{
                 (0,    "零元整")
                ,(1,    "壹元整")
                ,(10,   "壹拾元整")
                ,(15,   "壹拾伍元整")
                ,(100,  "壹佰元整")
                ,(110,  "壹佰壹拾元整")
                ,(1000, "壹仟元整")
                ,(1001, "壹仟零壹元整")
                ,(1011, "壹仟零壹拾壹元整")
                ,(1101, "壹仟壹佰零壹元整")
                ,(1234, "壹仟贰佰叁拾肆元整")
                ,(10000,    "壹万元整")
                ,(11001,    "壹万壹仟零壹元整")
                ,(100000,   "壹拾万元整")
                ,(100001,   "壹拾万零壹元整")
                ,(100101,   "壹拾万零壹佰零壹元整")
                ,(110100,   "壹拾壹万零壹佰元整")
                ,(123456,   "壹拾贰万叁仟肆佰伍拾陆元整")
                ,(1000000,  "壹佰万元整")
                ,(1001111,  "壹佰万零壹仟壹佰壹拾壹元整")
                ,(10000000, "壹仟万元整")
                ,(10100100, "壹仟零壹拾万零壹佰元整")
                ,(11010000, "壹仟壹佰零壹万元整")
                ,(11010100, "壹仟壹佰零壹万零壹佰元整")
                ,(11010101, "壹仟壹佰零壹万零壹佰零壹元整")
                ,(12345678, "壹仟贰佰叁拾肆万伍仟陆佰柒拾捌元整")
                ,(1_0000_0000,    "壹亿元整")
                ,(10_0000_0000,   "壹拾亿元整")
                ,(10_0000_0001,   "壹拾亿零壹元整")
                ,(10_0000_1000,   "壹拾亿零壹仟元整")
                ,(10_0000_1001,   "壹拾亿零壹仟零壹元整")
                ,(10_0001_1001,   "壹拾亿零壹万壹仟零壹元整")
                ,(10_0100_1001,   "壹拾亿零壹佰万零壹仟零壹元整")
                ,(10_0101_1001,   "壹拾亿零壹佰零壹万壹仟零壹元整")
                ,(10_1101_1001,   "壹拾亿零壹仟壹佰零壹万壹仟零壹元整")
                ,(100_0000_0000,  "壹佰亿元整")
                ,(100_1000_1000,  "壹佰亿零壹仟万零壹仟元整")
                ,(1000_0000_0000, "壹仟亿元整")
                ,(1000_1000_1000, "壹仟亿零壹仟万零壹仟元整")
                ,(1001_1101_1001, "壹仟零壹亿壹仟壹佰零壹万壹仟零壹元整")
                ,(1010_1101_1001, "壹仟零壹拾亿零壹仟壹佰零壹万壹仟零壹元整")
                ,(1111_1111_1111, "壹仟壹佰壹拾壹亿壹仟壹佰壹拾壹万壹仟壹佰壹拾壹元整")
                ,(1234_5678_9012, "壹仟贰佰叁拾肆亿伍仟陆佰柒拾捌万玖仟零壹拾贰元整")
                ,(10000_0000_0000,"壹万亿元整")
                ,(10_0000_0000_0000,    "壹拾万亿元整")
                ,(100_0000_0000_0000,   "壹佰万亿元整")
                ,(12_3456_7890, "壹拾贰亿叁仟肆佰伍拾陆万柒仟捌佰玖拾元整")
                ,(1.11m,"壹元壹角壹分")
                ,(1010501.00m,"壹佰零壹万零伍佰零壹元整")
                ,(1.10m,"壹元壹角")
                ,(1.01m,"壹元零壹分")
                ,(1.001m,"壹元整")
                ,(1.155m,"壹元壹角伍分")
                ,(0.55m,"伍角伍分")
                ,(0.001m,"零元整")
                ,(0.006m,"零元整")
                ,(0.01m,"零壹分")
                ,(0.10m,"壹角")
                ,(0.11m,"壹角壹分")
                ,(0.106m,"壹角")
                ,(10.01m,"壹拾元零壹分")
                ,(10.1m,"壹拾元壹角")
                ,(10.11m,"壹拾元壹角壹分")
                ,(2.1m,"贰元壹角")
            };
        }

        private static Dictionary<decimal, string> InnerGetCnFmtTestData()
        {
            var dic = new Dictionary<decimal, string>
            {
                [1010501.00m] = "壹佰零壹万零伍佰零壹点零零",
                [1.10m] = "壹点壹零",
                [1.01m] = "壹点零壹",
                [1.001m] = "壹点零零壹",
                [1.155m] = "壹点壹伍伍",
                [0.55m] = "零点伍伍",
                [0.001m] = "零点零零壹",
                [0.006m] = "零点零零陆",
                [0.01m] = "零点零壹",
                [0.10m] = "零点壹零",
                [0.11m] = "零点壹壹",
                [0.106m] = "零点壹零陆",
                [10.01m] = "壹拾点零壹",
                [10.1m] = "壹拾点壹",
                [10.11m] = "壹拾点壹壹",
                [2.1m] = "贰点壹"
            };
            return dic;
        }

        public static List<(decimal, string)> GetCnFmtTestData()
        {
            var dic = InnerGetCnFmtTestData();
            var list = new List<(decimal, string)>(GetRmbFmtTestData());

            for (var i = 0; i < list.Count; i++)
            {
                (decimal d, string s) = list[i];

                if (dic.TryGetValue(d, out var s2))
                {
                    list[i] = (d, s2);
                }
                else
                {
                    s2 = s;
                    if (s2.EndsWith("元整"))
                    {
                        s2 = s.Substring(0, s.Length - 2);
                    }
                    else
                    {
                        s2 = s.Replace("元", "点").Replace("角", "").Replace("分", "");
                    }
                    list[i] = (d, s2);
                }
            }

            return list;
        }
    }
}
